# TagAngleParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TagAngleParam Property
ParameterTypeId Class See Also
---
"Angle"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TagAngleParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TagAngleParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TagAngleParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace